let local_database=[
  {
    avatar: '/images/avatar/2.png',
    date: 'Apr 25 2020',
    title: '可爱的小螃蟹',
    post_img: '/images/post/crab.png',
    content: '洗净煮熟的螃蟹，香气诱人；打开橙红色的蟹壳，满满的蟹膏、蟹黄让人食欲大增。难怪民间早有“河蟹上席百味淡”以及“不到庐山辜负目，不吃螃蟹辜负腹”之说。',
    collection: 34,
    reading: 23,
    author: '林白衣',
    detail: '洗净煮熟的螃蟹，香气诱人；打开橙红色的蟹壳，满满的蟹膏、蟹黄让人食欲大增。难怪民间早有“河蟹上席百味淡”以及“不到庐山辜负目，不吃螃蟹辜负腹”之说。诱人鲜香从哪里来？螃蟹有着特殊的香气和浓郁的风味。隆起的蟹壳里面究竟包裹着怎样的秘密，才让人如此垂涎？螃蟹味道鲜美，关键在于其水溶性成分。其中，游离氨基酸是水产品呈味的基础物质之一。有研究显示，螃蟹不同部位的游离氨基酸总量分别为19.32mg/g(蟹足肉)、15.89mg/g（体肉）和20.88mg/g（蟹膏）。呈味氨基酸总量分别占其相应部位中游离氨基酸总量的58%(蟹足肉)、61%（体肉）和57%（蟹膏）左右。除了味觉的享受，螃蟹诱人的香气也令人难忘。那么在餐桌上，螃蟹散发的香气又是些什么组成部分呢？人们从螃蟹的体肉、钳肉、蟹足肉和性腺中鉴别出了50多种香气物质。这些香气物质所产生的影响力并不相同，人们进一步发现，其中有10多种物种的香气活性是比较高的。',
    postId: 0,
    music: {
      id: 375168,
      title: "无与伦比的美丽",
      author: "苏打绿",
      coverImg: "https://p1.music.126.net/yESd9oK4aL-07CkU9JSMtg==/109951163434348114.jpg"
    }
  },
  {
    avatar: '/images/avatar/3.png',
    date: 'Apr 23 2020',
    title: '比利林恩的中场战事',
    post_img: '/images/post/bl.png',
    content: '伊拉克战争时期，来自美国德州的19岁技术兵比利·林恩（乔·阿尔文 Joe Alwyn 饰）因为一段偶然拍摄的视频而家喻户晓。',
    collection: 57,
    reading: 89,
    author: '周行',
    detail: '伊拉克战争时期，来自美国德州的19岁技术兵比利·林恩（乔·阿尔文 Joe Alwyn 饰）因为一段偶然拍摄的视频而家喻户晓。那是一次规模不大却激烈非常的遭遇战，战斗中林恩所在的B班班长（范·迪塞尔 Vin Diesel 饰）遭到当地武装分子的伏击和劫持，而林恩为了营救班长不惜铤而走险冲锋陷阵。视频公布于世让他成为全美民众所崇拜的英雄，然而却鲜有人理解他和战友们所经历的一切。为了安葬班长，B班得到了短暂的休假，因此他们得以受邀参加一场在德州举行的橄榄球比赛。林恩的姐姐因某事件深感愧疚，她希望弟弟能借此机缘回归普通生活。而周围的经纪人、球迷、大老板、普通民众则对战争、卫国、士兵有着各种各样想当然的理解。球场上的庆典盛大开幕，林恩和战友们的心却愈加沉重与焦躁……',  
    postId: 1,
    music: {
      id: 521493845,
      title: "达拉崩吧",
      author: "言和",
      coverImg: "https://p2.music.126.net/gRpQYV_qFRIDJhlFSRkHsA==/109951163074675820.jpg"
    }
  },
  {
    avatar: '/images/avatar/4.png',
    date: 'Mar 23 2020',
    title: '寺庙',
    post_img: '/images/post/sls.jpg',
    content: '时间绵延流动的绘画美，以理智的入世精神排斥了非理性的迷狂。中国古代寺庙的寺庙建筑布局大多是正面中路为山门，山门内左右分别为钟楼、鼓楼……',
    collection: 43,
    reading: 90,
    author: 'coco',
    detail: '时间绵延流动的绘画美，以理智的入世精神排斥了非理性的迷狂。中国古代寺庙的寺庙建筑布局大多是正面中路为山门，山门内左右分别为钟楼、鼓楼，正面是天王殿，殿内有四大金刚塑像，后面依次为大雄宝殿和藏经楼，僧房、斋堂则分列正中路左右两侧。大雄宝殿是佛寺中最重要、最庞大的建筑，“大雄”即为佛祖释加牟尼。隋唐以前的佛寺，一般在寺前或宅院中心造塔，隋唐以后，佛殿普遍代替了佛塔，寺庙内大都另辟塔院。中国佛寺不论规模地点，其建筑布局是有一定规律的：平面方形，以山门殿———天王殿———大雄宝殿———本寺主供菩萨殿———法堂———藏经楼这条南北纵深轴线来组织空间，对称稳重且整饬严谨。沿着这条中轴线，前后建筑起承转合，宛若一曲前呼后应、气韵生动的乐章。中国寺庙的建筑之美就响应在群山、松柏、流水、殿落与亭廊的相互呼应之间，含蓄温蕴，展示出组合变幻所赋予的和谐、宁静及韵味。',  
    postId: 2,
    music: {
      id: 1427051960,
      title: "不要说话",
      author: "古依",
      coverImg: "https://p1.music.126.net/yyYPt2KE2Z5GVCRXE2pDMA==/109951164754311314.jpg"
    }
  },
  {
    title: "微信·小程序开发工具安装指南",
    content: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序",
    imgSrc: "/images/post/xiaolong.jpg",
    reading: 102,
    detail: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序:微信小程序不能开发游戏类、直播类功能，小程序每个人关注的上限是20个（还不确定，不过我相信这是真的，这次公布的API里并没有视频组件。微信太大，苹果要有所顾忌，但是微信也要做出相应的让步)微信目前有没有同苹果商谈好，还是个未知数，毕竟会对AppStore有一定的冲击。抛弃了大量的javascript组件后，这个生态体系变得相当的封闭，微信解释肯定是：为了更好的性能提升。那么我们拭目以待。小程序的入口是微信里的三级菜单，就是在“Tab栏发现里的游戏下面加入一个“小程序”。",
    collection: 92,
    post_img: "/images/post/xiaolong.jpg",
    author: "猫是猫的猫",
    date: "Feb 14 2020",
    avatar: "/images/avatar/5.png",
    postId: 3,
    music: {
      id: 33911781,
      title: "未闻花名",
      author: "茅野爱衣",
      coverImg: "https://p1.music.126.net/daZcHVIJicL3wXJWMIjAng==/7926379325753633.jpg",
    }
},
{
    title: "从视觉到触觉 这款VR手套能给你真实触感",
    content: "8月29日消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品",
    imgSrc: "/images/post/vr.png",
    reading: 102,
    detail: "消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品。该产品名为“Dexmo”，它是一款像手套那样戴在手上使用的未来主义外骨骼。它内置大量的元件，能够与VR体验进行交互，可帮助你感觉握在你的双手的虚拟物体。Dexmo据Dexta称，“Dexmo是一款针对你的双手的机械外骨骼。它能够捕捉你的手部运动，以及提供即时的力反馈。有了Dexmo，你可以感受到虚拟物体的大小、形状和坚硬度。你可以接触数字世界。”市面上已经有数款产品旨在处理虚拟现实中的手部交互，也有相关的产品即将要进入市场。例如，颇受欢迎的HTC Vive头盔配有一副控制器，其控制器能够使得追踪系统看到你的双手，让你可以用它们来在特定体验中与物体进行交互。今年晚些时候，Oculus将开始出货类似的手部控制产品Oculus Touch。10月，索尼也将开始出货配备两个PlayStation Move手部控制器的PS VR。Leap Motion甚至更进一步：利用传感器来追踪手指和手部的运动。",
    collection: 26,
    post_img: "/images/post/vr.png",
    author: "深白色",
    date: "Jan 20 2020",
    avatar: "/images/avatar/1.png",
    postId: 4,
    music: {
      id: 298213,
      title: "夏天的风",
      author: "温岚",
      coverImg: "https://p2.music.126.net/1EDhWA3a0oIagLtiK41qrw==/109951163239130461.jpg"
    }
},  
];

module.exports={
  postList: local_database
};